uat_chat/DataProcessors/ксСканерUbio.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ксСканерUbio</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>компонентаUBIO</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>компонентаТерминал</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСканера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

uat_chat/DataProcessors/ксСканерUbio/Ext/ObjectModule.bsl
Процедура ПроверитьФайлДрайвера(ИмяДрв)
	
	Путь =  КаталогПрограммы()+"\"+ИмяДрв+".dll";
	Файл = Новый Файл(Путь);
	Если Файл.Существует()=Ложь Тогда
		ПолучитьМакет(ИмяДрв).Записать(КаталогПрограммы()+"\"+ИмяДрв+".dll");
		Сообщить("Скопирован файл :"+Путь);
	КонецЕслИ;
	
КонецПроцедуры

Процедура ПроверитьДрайвера() Экспорт
	
	
	ПроверитьФайлДрайвера("AvzScanner");
	ПроверитьФайлДрайвера("tc400");
	ПроверитьФайлДрайвера("AnvizComponent");
	
КонецПроцедуры

Функция ПодключитьКомпонентуUBio() Экспорт 
	Если НЕ компонентаUBIO = Неопределено Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	ИДСканера = -1;
	Подключение = ПодключитьВнешнююКомпоненту(КаталогПрограммы()+"AnvizComponent.dll","AV",ТипВнешнейКомпоненты.Native);
	Если Подключение Тогда 
		компонентаТерминал = Новый ("Addin.AV.AnvizComponent");
		компонентаUBIO  =Новый ("Addin.AV.AnvizUBIO");
		компонентаUBIO._ЛогФайл = КаталогПрограммы()+"\AnvizUBIOlog.txt";

		стр=компонентаUBIO.НайтиУстройства();
		Если ПустаяСтрока(Стр)=Ложь Тогда 
			Мас = ЗначениеИзСтрокиВнутр(стр);
			Если Мас.Количество()>0 Тогда
				ИДСканера = 0;	
			КонецЕСЛИ;
		КонецЕсли;	
		
		Возврат Истина;
	Иначе
		Сообщить("Ошибка создания внешней компоненты!!!");
		компонентаТерминал = Неопределено;
		компонентаUBIO = Неопределено;
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции
